package ua.edu.hneu.oop.java.lr5.task2;

public class MainClass {

//    Описать класс, соответствующий индивидуальному варианту задания. Создать параметризованную коллекцию для хранения объектов описанного класса. Вид коллекции выбрать самостоятельно. Написать программу для работы с этой коллекцией, позволяющее выполнять:
//1. добавление элемента в коллекцию с клавиатуры;
//2. считывание данных из файла;
//3. запись данных в тот же или указанный файл;
//4. сортировку данных по различным критериям;
//5. поиск элемента по заданному полю;
//6. вывод всех элементов, удовлетворяющих заданному условию;
//7. удаление элемента из коллекции.
//    Приложение должно содержать меню и предусматривать обработку ошибок.

                        //Описать класс с именем STUDENT, содержащий следующие поля:
                        // фамилия и инициалы;
                        // номер группы;
                        // успеваемость (массив из пяти элементов).
    //Написать программу, выполняющую следующие действия:
    //см. общее задание в начале документа;
    //ввод с клавиатуры данных (записи должны быть упорядочены по возрастанию среднего балла);
    //вывод на экран фамилий и номеров групп для всех студентов, имеющих оценки 4 и 5 (если таких студентов нет, вывести соответствующее сообщение)
    public static void main(String[] args) {

    }
}
